<calendar SQL>
use spring;
DROP TABLE IF EXISTS calendar;
CREATE TABLE IF NOT EXISTS calendar(
no INTEGER AUTO_INCREMENT PRIMARY KEY,
id VARCHAR(10) NOT NULL,
title VARCHAR (30),
Description VARCHAR(200),
StartDate timestamp,
EndDate timestamp,
TextColor VARCHAR(50),
backgroundColor varchar(50),
CONSTRAINT calendar FOREIGN KEY(id) REFERENCES emptable(employee_id)
)ENGINE=InnoDB DEFAULT CHARSET=utf8;


INSERT INTO calendar (id, title, description, StartDate, EndDate, TextColor, backgroundColor) VALUES 
('1000','경영전략회의','4월 회의', '2022-04-17 13:00:00', '2022-04-17 14:00:00','#FFFFFF', '#FFC0CB'),
('1000','비상경영회의','회의', '2022-04-15 13:00:00', '2022-04-15 14:00:00','#FFFFFF', '#FFC0CB'),
('1000', '개발회의','제안서 보고하기', '2022-04-02 15:30:00', '2022-04-02 16:00:00', '#FFFFFF', '#FFC0CB'),
('1000','이슈사항보고','미팅문제 보고', '2022-04-03 14:00:00', '2022-04-03 18:00:00','#FFFFFF', '#FFC0CB'),
('1002','임원회의참석','신입 계약서 작성', '2022-04-18 10:30:00', '2022-04-18 12:00:00', '#FFFFFF', '#FFC0CB'),
('1003', '향후계획안','기획안제출 ', '2022-04-20 19:00:00', '2022-04-20 22:00:00','#FFFFFF', '#FFC0CB'),
('1005', '모델링','개발회의', '2022-04-02 15:30:00', '2022-04-03 16:00:00', '#FFFFFF', '#FFC0CB'),
('1006', '디자인회의','시안확인', '2022-04-07 15:30:00', '2022-04-09 16:00:00', '#FFFFFF', '#FFC0CB'),
('1001','경영전략회의','5월 회의', '2022-04-17 13:00:00', '2022-04-17 14:00:00','#FFFFFF', '#FFC0CB'),

('1002','경영설명회 참석','외부', '2022-05-18 10:30:00', '2022-05-18 12:00:00', '#FFFFFF', '#FFC0CB'),
('1003', '보고자료 최종제출','보고서제출', '2022-05-22 19:00:00', '2022-05-22 22:00:00','#FFFFFF', '#FFC0CB'),
('1005', '개발회의','제안서 보고하기', '2022-05-02 15:30:00', '2022-05-02 16:00:00', '#FFFFFF', '#FFC0CB'),
('1007','이슈사항보고','미팅문제 보고', '2022-05-03 14:00:00', '2022-05-03 18:00:00','#FFFFFF', '#FFC0CB'),
('1002','임원회의참석','신입 계약서 작성', '2022-05-18 10:30:00', '2022-05-18 12:00:00', '#FFFFFF', '#FFC0CB'),
('1003', '향후계획안','기획안제출 ', '2022-05-20 19:00:00', '2022-05-20 22:00:00','#FFFFFF', '#FFC0CB'),
('1005', '모델링','개발회의', '2022-05-02 15:30:00', '2022-05-02 16:00:00', '#FFFFFF', '#FFC0CB'),
('1006', '디자인회의','시안확인', '2022-05-09 15:30:00', '2022-05-09 16:00:00', '#FFFFFF', '#FFC0CB'),
('1001','경영전략회의','5월 회의', '2022-05-17 13:00:00', '2022-05-17 14:00:00','#FFFFFF', '#FFC0CB'),
('1007','거래처미팅','사업제안서 보고미팅', '2022-05-04 14:00:00', '2022-05-04 16:00:00','#FFFFFF', '#FFC0CB'),

('1005', '체육대회','제안서 보고하기', '2022-06-02 15:30:00', '2022-06-02 16:00:00', '#FFFFFF', '#FFC0CB'),
('1007','이슈사항보고','미팅문제 보고', '2022-06-03 14:00:00', '2022-06-03 18:00:00','#FFFFFF', '#FFC0CB'),
('1002','임원회의참석','신입 계약서 작성', '2022-06-18 10:30:00', '2022-06-18 12:00:00', '#FFFFFF', '#FFC0CB'),
('1003', '향후계획안','기획안제출 ', '2022-06-20 19:00:00', '2022-06-20 22:00:00','#FFFFFF', '#FFC0CB'),
('1005', '모델링','개발회의', '2022-06-02 15:30:00', '2022-06-02 16:00:00', '#FFFFFF', '#FFC0CB'),
('1006', '디자인회의','시안확인', '2022-06-09 15:30:00', '2022-06-09 16:00:00', '#FFFFFF', '#FFC0CB'),
('1001','경영전략회의','5월 회의', '2022-06-17 13:00:00', '2022-06-17 14:00:00','#FFFFFF', '#FFC0CB');
commit;


SELECT * fROM calendar;
commit;
SELECT * fROM calendar;

SELECT * FROM calendar
WHERE StartDate >= LAST_DAY('2022-04-25');

-- 지정한 날이 속한 달의 마지막 날 구하기
SELECT LAST_DAY('2022-04-25') FROM dual;

-- 지정한 날이 속한 달의 첫 날 구하기
-- 마지막 날을 구하는 함수는 있지만 첫 날을 구하는 함수는 없음
-- 마지막 날을 구하는 함수를 활용해 1개월을 마이너스해 구하면 됨
SELECT LAST_DAY('2022-04-25' - INTERVAL 1 MONTH) FROM dual;








