<calendarmeeting SQL>
use spring;
DROP TABLE IF EXISTS calendarmeeting;

CREATE TABLE IF NOT EXISTS calendarmeeting(
no INTEGER AUTO_INCREMENT PRIMARY KEY,
id VARCHAR(10) NOT NULL,
title VARCHAR (30),
Description VARCHAR(200),
StartDate timestamp,
EndDate timestamp,
TextColor VARCHAR(50),
backgroundColor varchar(50),
CONSTRAINT calendarmeeting FOREIGN KEY(id) REFERENCES emptable(employee_id)
)ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO calendarmeeting (id, title, Description, StartDate, EndDate, TextColor, backgroundColor)
 VALUES 
('1001', '101호 회의실', '디자인팀 신입교육', '2022-04-16 13:00:00', '2022-04-16 15:00:00','#FFFFFF', '#00008B'),
('1001', '102호 회의실', '경영팀 세미나', '2022-04-22 09:00:00', '2022-04-22 17:30:00','#FFFFFF', '#00008B'),
('1001', '102호 회의실', '경영팀 세미나', '2022-04-21 09:00:00', '2022-04-22 17:30:00','#FFFFFF', '#00008B'),
('1001', '102호 회의실', '경영팀 세미나', '2022-04-24 09:00:00', '2022-04-22 17:30:00','#FFFFFF', '#00008B'),
('1005', '201호 회의실', '개발팀 아이템 회의', '2022-04-18 16:00:00', '2022-04-18 18:00:00','#FFFFFF', '#00008B'),
('1005', '202호 회의실', '개발팀 아이템 회의', '2022-04-18 13:00:00', '2022-04-18 16:00:00','#FFFFFF', '#00008B'),
('1005', '202호 회의실', '개발팀 아이템 회의', '2022-04-19 13:00:00', '2022-04-19 16:00:00','#FFFFFF', '#00008B'),
('1000', '301호 회의실', '간부회의', '2022-04-06 13:00:00', '2022-04-06 18:00:00','#FFFFFF', '#00008B'),
('1002', '302호 회의실', '경영팀 인턴 교육', '2022-04-16 13:00:00', '2022-04-16 15:00:00','#FFFFFF', '#00008B'),
('1002', '302호 회의실', '경영팀 인턴 교육', '2022-04-01 13:00:00', '2022-04-01 15:00:00','#FFFFFF', '#00008B'),
('1002', '302호 회의실', '경영팀 인턴 교육', '2022-04-02 13:00:00', '2022-04-02 15:00:00','#FFFFFF', '#00008B'),
('1007', '201호 회의실', '영업팀 월말 회의', '2022-04-28 13:00:00', '2022-04-28 16:00:00','#FFFFFF', '#00008B'),
 ('1001', '101호 회의실', '디자인팀 신입교육', '2022-05-03 13:00:00', '2022-05-04 15:00:00','#FFFFFF', '#00008B'),
 ('1001', '101호 회의실', '디자인팀 신입교육', '2022-05-11 13:00:00', '2022-05-12 15:00:00','#FFFFFF', '#00008B'),
 ('1001', '101호 회의실', '디자인팀 신입교육', '2022-05-16 13:00:00', '2022-05-16 15:00:00','#FFFFFF', '#00008B'),
 ('1001', '101호 회의실', '디자인팀 신입교육', '2022-05-20 13:00:00', '2022-05-20 15:00:00','#FFFFFF', '#00008B'),
('1001', '101호 회의실', '디자인팀 신입교육', '2022-05-16 13:00:00', '2022-05-16 15:00:00','#FFFFFF', '#00008B'),
 ('1005', '301호 회의실', '가나다라', '2022-05-30 13:00:00', '2022-05-31 15:00:00','#FFFFFF', '#00008B'),
 ('1002', '201호 회의실', 'JayPark', '2022-05-25 13:45:00', '2022-05-27 18:38:00','#FFFFFF', '#00008B'),
 ('1007', '201호 회의실', '영업팀 신입교육', '2022-05-18 13:00:00', '2022-05-20 15:00:00','#FFFFFF', '#00008B');
commit;
SELECT * fROM calendarmeeting;